Tekla.Structures.ModelInternal.dotPosition_t
Struct for the Position.

Tekla.Structures.ModelInternal.dotPosition_t.PlaneOffset
Offsets away from the value.

Tekla.Structures.ModelInternal.dotPosition_t.DepthOffset
Offsets away from the value.

Tekla.Structures.ModelInternal.dotPosition_t.RotationOffset
Offsets away from the value.

Tekla.Structures.ModelInternal.dotPosition_t.Plane
Positioning in the following sense.

Tekla.Structures.ModelInternal.dotPosition_t.Depth
Positioning in the following sense.

Tekla.Structures.ModelInternal.dotPosition_t.Rotation
Positioning in the following sense.